app/controllers/products_controller.rb

  def index
    render template: 'products/index.html.erb', locals: { products: Product.all }
---
SELECT "products".* FROM "products"

  def index_automotive
    products = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"

  def index_electronics
    products = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"

  def index_industrial
    products = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"

  def index_tools
    products = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"

  def index_music
    products = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"

  def show
    if Product.exists?(params[:id])
      render template: 'products/show.html.erb', locals: { product: Product.find(params[:id]) }
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]